---
kind: property
id: P:Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelSetOptions.HasLeader
source: html/5ef84857-1ef1-6287-b5cc-231a314ad0db.htm
---
# Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelSetOptions.HasLeader Property

Specifies if the label will have a leader.
 The default value is true.

## Syntax (C#)
```csharp
public bool HasLeader { get; set; }
```